#+title: Variabler
#+subtitle: Programmering B
#+options: toc:nil timestamp:nil 

* Anvendelse af variabler
En variabel i programmering og i sproget =python= er et mærkat, som sættes på en værdi, der kan variere.

Python kan f.eks. bruges, som lommeregner. Lad os antage at vi vil bruge funktionen

$$f(x)=2x^2-3x-4$$

og så udregne funktionsværdierne når x er hhv 1, 2, 3, 4,5 osv.

For x=1 kan vi f.eks. skrive følgende for at beregne f(1)
#+begin_src python :exports both :results output :eval never-export
print(2*1**2 -3*1-4)
#+end_src

#+RESULTS:
#+begin_example
-5
#+end_example

Hvis vi så skal gøre det samme for de andre x-værdier, skal vi ændre 1-tallet alle steder i udtrykket.

#+begin_src python :exports both :results output :eval never-export
print(2*5**2 -3*5-4)
#+end_src

#+RESULTS:
#+begin_example
31
#+end_example

Det bliver hurtigt kedeligt i længden!

I stedet kan vi *deklarere* en =variabel=, så vi kun skal ændre værdien *ét* sted.

#+begin_src python :exports both :results output :eval never-export
x = 42

print(2*x**2 -3*x-4)
#+end_src

#+RESULTS:
#+begin_example
3398
#+end_example

*Prøv selv at se, hvad der er hurtigst for jer, hvis I skal bruge koden til at beregne de fem funktionsværdier. Kodestumperne kan nemt kopieres fra denne præsentation, hvis den vises vha github.*

Her er *x* en variabel som bliver *sat til* værdien 1. = sætter x til den værdi, der står til *højre* for lighedstegnet. I Matematik kan ligninger læses både fra venstre og fra højre. I programmering læses udtrykkene *altid* fra venstre mod højre.

** Forøgelse af værdier
Hvad sker der her? Hvad er forskellen
#+begin_src python -n :exports both :results output :eval never-export
x = 3
print(x+1)
print(x+1)
x = x + 1
print(x+1)
#+end_src

#+RESULTS:
#+begin_example
4
4
5
#+end_example

** Forøg og formindsk
Der er mange måder, hvorpå man kan forøge og formindske værdien af en variabel.

#+begin_src python :exports both :results output :eval never-export
# Saetter x til vaerdien
x = 3
print(x)
# Foroeg x med 1
x = x + 1
print(x)
# Formindsk x med 2
x = x - 2
print(x)
# Multiplicer x med 10
x = 10 * x
print(x)
# Divider x med 5
x = x / 5
print(x) 
#+end_src

#+RESULTS:
#+begin_example
3
4
2
20
4.0
#+end_example

I ~python~ er der specielle genveje til disse ændringer

| Operator | Beskrivelse                |
|----------+----------------------------|
| =        | Tildeling af værdi         |
| +=       | Forøgelse af værdi med     |
| -=       | Formindskelse af værdi med |
| *=       | Multiplicer med            |
| **=      | Opløst i                   |
| /=       | Divider med                |
| //=      | Heltalsdivider med         |
| %=       | Modulus med                |

De forrige eksempler kan nu skrives some

#+begin_src python :exports both :results output :eval never-export
# Saetter x til vaerdien
x = 3
print(x)
# Foroeg x med 1
x += 1
print(x)
# Formindsk x med 2
x -= 2
print(x)
# Multiplicer x med 10
x *= 10 
print(x)
# Divider x med 5
x /= 5
print(x)
#+end_src

#+RESULTS:
#+begin_example
3
4
2
20
4.0
#+end_example

* Print af variable
Hvordan kan vi få python til at skrive "Mit navn er Jacob", hvor Jacob er værdien af en variabel, der hedder navn?

Her er en række mere eller mindre gode måder at gøre det på:

#+begin_src python :exports both :results output :eval never-export
navn = "Jacob"
print("Mit navn er", navn)
#+end_src

#+RESULTS:
#+begin_example
Mit navn er Jacob
#+end_example

Hvad nu, hvis vi vil have et punktum med?

#+begin_src python :exports both :results output :eval never-export
navn = "Jacob"
print("Mit navn er", navn, ".")
#+end_src

#+RESULTS:
#+begin_example
Mit navn er Jacob .
#+end_example


Det ser ikke helt rigtig nu. Lad os prøve noget andet.

#+begin_src python :exports both :results output :eval never-export
navn = "Jacob"
print("Mit navn er"+ navn+ ".")
#+end_src

#+RESULTS:
#+begin_example
Mit navn erJacob.
#+end_example


Næsten. Der mangler lige et mellemrum.

#+begin_src python :exports both :results output :eval never-export
navn = "Jacob"
print("Mit navn er "+ navn+ ".")
#+end_src

#+RESULTS:
#+begin_example
Mit navn er Jacob.
#+end_example



#+begin_src python :exports both :results output :eval never-export
alder = 38 
print("Min alder er "+ alder+ ".")
#+end_src

#+RESULTS:

Hmm, det kan løses ved at =konvertere= heltallet 11 til en tekststring

#+begin_src python :exports both :results output :eval never-export
alder = 38
print("Min alder er "+ str(alder)+ ".")
#+end_src

#+RESULTS:
#+begin_example
Min alder er 38.
#+end_example

Der findes nemmere måder at gøre dette på i python.

Man kan anvende ~format~

#+begin_src python :exports both :results output :eval never-export
navn = "Eleven"
alder = 11
print("Mit navn er {0}. Min alder er {1}.".format(navn, alder))
#+end_src

#+RESULTS:
#+begin_example
Mit navn er Eleven. Min alder er 11.
#+end_example


Men endnu bedre er det at anvende *formatterede strenge* (f-strings)

#+begin_src python :exports both :results output :eval never-export
navn = "Eleven"
alder = 11
print(f"Mit navn er {navn}. Min alder er {alder}.")
#+end_src

#+RESULTS:
#+begin_example
Mit navn er Eleven. Min alder er 11.
#+end_example

f-strings blev først indført i python ved version 3.6. Syntaksen er således, at der skal skrives et lille *f* foran citationstegnet og variabelnavnet i selve tekststrengen skal omgives med krøllede parenteser (curly brackets, {}).

Fidusen med f-strings er, at det nemt at læse selve koden og direkte forstå, hvad der printes ud.

